# 作业：
# 1、用自己的理解方式编码举例LEGB规则
# Local-->Enclosed-->Global-->Built in
# Local 指的就是函数或者类的方法内部
# Enclosed  指的是嵌套函数(一个函数包裹另一个函数,闭包)
# Global  指的是模块中的全局变量
# Built in  指的是Python为自己保留的特殊名称



# 2、用函数递归的方式求 4！
def fact(n):
    if n == 1:
        return 1
    result = n * fact(n - 1)
    return result
print('n的阶乘是：',fact(5))

# 3、编写一个匿名函数，能求出3个数的最大值
calc = lambda a,b,c : max(a,b,c)
print(calc(2,223,5))


# 4、python模块的导入方式有哪几种？（问答）
#方式1：导入整个模块  import 模块名称
#方式2：与from连用导入整个模块  from 模块名称 import *
#方式3：与from连用导入多个对象  from 模块名称 import 对象1[对象2，对象3]

# 5、用包和不用包的区别在哪里？
#用包可以使代码的模块结构更清晰，调用起来更方便



# 6、编写用户登陆系统
# 需求：
# 1.系统里面有多个用户，用户的信息目前保存在列表里面
#    users = ['root','westos']
#    passwd = ['123','456']
# 2.用户登陆(判断用户登陆是否成功）
#    1).判断用户是否存在
#    2).如果存在
#        1).判断用户密码是否正确
#        如果正确，登陆成功，退出循环
#        如果密码不正确，重新登陆，总共有三次机会登陆
#    3).如果用户不存在
#    重新登陆，总共有三次机会

