# 1、根据用户输入的玫瑰花的朵数输出其代表的意义：在古代希腊神话中，玫瑰花集爱情与美丽于一身，所以人们常用玫瑰来表达爱情，
# 但是不同的朵数带表的含义是不同的。
#    1朵表是：你是我的唯一。3朵表是：我爱你。10朵表示：十全十美。99朵表示：天长地久。108朵表示：求婚！





# 2、国家对酒驾的规定是：车辆驾驶人员血液中的酒精含量小于20mg/100ml不构成饮酒驾驶行为。含量大于或者等于20mg/100ml,小于80mg/100ml为饮酒驾车，酒精含量大于或者等于80mg/100ml加醉驾车。现写一段代码判断输入的血液酒精含量是否为酒驾。
# 3、小明身高1.75m，体重80.5kg。请根据BMI公式（体重除以身高的平方）帮小明计算他的BMI指数，并根据BMI指数：
# 低于18.5：过轻
# 18.5-25：正常
# 25-28：过重
# 28-32：肥胖
# 高于32：严重肥胖
#
#
# 4、使用循环语句计算从1到100，一共有多少个尾数为7或者7的倍数这样的数，请输出这样的数。
# 5、模拟支付宝的蚂蚁森林通过日常的走步--20g，生活缴费--50g，线下支付--100g，网络购票--80g，共享单车--200g等低碳，环保行为可以积攒能量，当能量达到一定数量后，可以种一棵真正的树--500g。
#    由用户输入环保行为，来积累能量；查询能量请输入能量来源！退出程序请输入0；
# 6、猜数字游戏，随机生成一个1到10之间的数(包括1和10)的数字作为基准数，玩家每次通过键盘输入一个数字，如果输入的数字和基准数字相同，则过关，否则重新输入。如果玩家输入-1，则表示退出游戏。
# 7、编写程序，设置您的余额，流量和剩余通话时间。模拟10086自助查询系统的功能：输入1，显示您当前的余额；输入2，显示您当前剩余的流量，单位为G；输入3，您当前的剩余通话，单位为分钟；输入0，退出自助查询系统。
# 8、几个好朋友一起玩逢七拍腿的游戏，即从1开始依次数数，当数到尾数为7的数或7的倍数时，则不报出该数，而是拍一下腿。现在编写程序，从1数99，假设每个人都没有出错，计算共要拍多少次腿。
#
# 9、输出2000-2020年之间的润年。
# 10、由用户输入三个整数，判断这三个数是否可以构成三角形。如果可以构成三角形的话，则进一步显示三角形的类型(等边，等腰，一般三角形)。如果不构成三角形的话，则给出提示信息。
